# Wire Distribution Direction Enumeration

Source: https://www.revitapidocs.com/2026/2c5558b4-57d4-1b81-e843-e79c5c1bbc21.htm

---

| Wire Distribution Direction Enumeration |
| --- |

Defines the direction of the distribution of wires in a Fabric Sheet.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum WireDistributionDirection
```

```
Public Enumeration WireDistributionDirection
```

```
public enum class WireDistributionDirection
```

```
type WireDistributionDirection
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| Major | 0 | Wires are distributed in the Major direction. |
| Minor | 1 | Wires are distributed in the Minor direction. |

See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace